[
    {
        "id":"stel-cytima",
        "name":"Stel Cytima",
        "featured": false,
        "featuredText": "",
        "showcaseImage": "background.png",
        "hasLogo": true,
        "content": [
            {
                "image": "race1.jpg",
                "title": "Résumé du projet",
                "text": [
                    "Stel Cytima est un jeu conçu dans le cadre d'un cours collégial.",
                    "Il s'agit d'un jeu de course orienté action où le joueur est amené à participer à différetes courses contre des opposants contrôlés par l'ordinateur.",
                    "Il existe divers arragements d'armes et véhicules pour différentes préférences de jeu",
                    "Puisqu'il s'agit d'un jeu futuristique, les véhicules ne possèdent pas de roues mais lévitent au-dessus du sol!"
                ],
                "style": "align-right"
            },
            {
                "image": "promo.png",
                "title": "Mon rôle",
                "text": [
                    "Pour ce projet, mes tâches principales ont été d'écrire le code concernant la physique et le contrôle des véhicules, l'intelligence artificielle des opposants ainsi que la création de mon propre véhicule.",
                    "Chaque véhicule possède quatre propulseurs qui lui permettent de rester stable. Plus un véhicule va vite, plus il gagne en force d'appui, lui permettant de monter des surfaces à grand angle.",
                    "L'intelligence artificielle demande au véhicule de se dirigier vers un point à quelques mètres plus loin sur la piste. Plus le véhicule va vite, plus l'IA doit compenser en choisissant un point plus éloigné."
                ],
                "style": "align-left"
            }
        ]
    },
    {
        "id":"alexis-draveur",
        "name":"Alexis le draveur",
        "featured": false,
        "featuredText": "",
        "showcaseImage": "render.png",
        "hasLogo": false,
        "content": [
            {
                "image": "gameplay.png",
                "title": "Résumé du projet",
                "text": [
                    "Voici Alexis le draveur un jeu créé en équipe dans un délai de deux jours pour l'Intercollégial de création de jeu du Collège de Valleyfield, édition 2020, gagnant en première place.",
                    "Il s'agit d'un jeu simple inspiré par l'histoire d'Alexis le trotteur, qui courait aussi vite qu'un train, sauf qu'ici, Alexis fait de la drave pour garder l'avance sur le train le plus longtemps possible."
                ],
                "style": "align-right"
            },
            {
                "image": "render.png",
                "title": "Mes tâches",
                "text": [
                    "Dans ce projet, mes réalisations sont surtout des modèles 3D ainsi que quelques rares bouts de programmation.",
                    "Le train, son animation et son icône dans l'interface, les arbres et le terrain sont les éléments sur lesquelles j'ai le plus travaillé."
                ],
                "style": "align-left"
            }
        ]
    },
    {
        "id":"croisade-prestation",
        "name":"Croisade à la prestation",
        "featured": false,
        "featuredText": "",
        "showcaseImage": "promo.png",
        "hasLogo": false,
        "content": [
            {
                "image": "1.png",
                "title": "Résumé du projet",
                "text": [
                    "Voici un jeu réalisé en équipe de quatre pour l'intercollégial de création de jeu du Collège de Valleyfield, édition 2021.",
                    "Ayant comme thème la révolte, je joueur incarne un voyou qui saccage la ville. Le but est simple: générer le plus de dommages, mesurés en dollars, à la ville, tout en étant poursuivi par les forces policières et avec une foule monstrueuse qui ajoute un plus grand niveau de pression."
                ],
                "style": "align-right"
            },
            {
                "image": "2.png",
                "title": "Mes tâches",
                "text": [
                    "Pour ce jeu créé en moins de 48 heures, mes tâches principales était d'aider à la conception du jeu et de son gameplay, le choix d'un style graphique et finalement, la modélisation de plusieurs tuiles de terrain et de bâtiments qui sont ajoutées aléatoirement et dynamiquement dans une partie. Finalement, j'ai aussi fait la création de la plupart des objets interactifs et leur intégration."
                ],
                "style": "align-left"
            }
        ]
    },
    {
        "id":"mirror",
        "name":"Mirror",
        "featured": true,
        "featuredText": "Projet de recherche",
        "showcaseImage": "code.png",
        "hasLogo": true,
        "content": [
            {
                "image": "",
                "title": "Introduction",
                "text": [
                    "Mirror est un API réseau de haut niveau pour Unity. Open source, puissant et compatible avec la plupart des APIs de bas niveau, il est une excellente option pour les créateurs de jeux ayant besoin d'une communication client/serveur.",
                    "Il a été créé sur les bases de Unet pour lui être une alternative directe et plus puissante pour les plus gros projets. Il est donc semblable au système maintenant obsolète qui était auparavent fourni avec Unity."
                ],
                "style": "full-text"
            },
            {
                "image": "",
                "title": "Autorité",
                "text": [
                    "« L’autorité » est un concept qui s’applique à un client ou au serveur. Un client qui possède l’autorité peut, par exemple, déplacer par lui-même un personnage de manière locale, sans vérification par le serveur.",
                    "Si le client n’a pas l’autorité, il faudra d’abord qu’il envoie une commande au serveur pour que celui-ci accomplisse la tâche. Par exemple, le client doit envoyer au serveur la commande de déplacer le personnage."
                ],
                "style": "full-text"
            },
            {
                "image": "",
                "title": "SyncVar et Remote Actions",
                "text": [
                    "SyncVar est un attribut de Mirror permettant la synchronisation d’une variable du serveur vers les clients en utilisant un hook (fonction ne s’exécutant que sur les clients).",
                    "Les « Remote Actions » ou actions distantes permettent quant à elles aux clients de communiquer au serveur (et vice-versa). Elle permettent l'envoie de commandes et peuvent aussi être utilisées pour la synchronisation client/serveur."
                ],
                "style": "full-text"
            }
        ]
    }
]